{
  "id_proyecto": "ML-001",
  "tema_general": "Machine Learning",
  "pregunta_esencial_base": "Si las plataformas que usamos a diario pueden 'aprender' lo que nos gusta, ¿podemos usar esa misma 'magia' para resolver problemas importantes en nuestra escuela o comunidad?",
  "niveles": [
    {
      "nivel_escolar": "Primaria",
      "titulo_adaptado": "Los Guardianes del Reciclaje: Entrenando a nuestra Caja Inteligente",
      "pregunta_esencial_adaptada": "¿Podemos enseñarle a una 'caja mágica' a clasificar la basura de nuestro salón para ayudar al planeta?",
      "producto_final_adaptado": "Una 'Caja Inteligente' física, hecha con materiales reciclados, que tiene compartimentos para diferentes tipos de basura. Los equipos presentan su caja y explican las 'reglas' que le enseñaron para clasificar correctamente, demostrándolo con ejemplos.",
      "objetivos_adaptados": [
        "Identificar y clasificar objetos según sus características (de qué está hecho, para qué sirve).",
        "Crear un conjunto de reglas visuales (un 'algoritmo' simple) para un proceso de clasificación.",
        "Colaborar en equipo para diseñar y construir una solución física a un problema del aula."
      ],
      "fases_adaptadas": [
        {
          "fase": 1,
          "titulo_fase": "Descubriendo la 'Magia' que Ordena",
          "descripcion": "Conversar sobre cómo las apps 'saben' qué nos gusta (si vemos videos de gatos, nos muestran más gatos). Identificar un problema en el salón: la basura está toda revuelta. Hacer una lluvia de ideas sobre los tipos de basura que generamos."
        },
        {
          "fase": 2,
          "titulo_fase": "¿Cuáles son las Reglas del Juego?",
          "descripcion": "En equipos, recibir una bolsa con distintos tipos de basura limpia (papel, plástico, envolturas). Su misión es ordenarla en montones y escribir o dibujar la regla para cada montón. 'Si se puede escribir en él, va en el montón de papel'. Estas son las 'instrucciones' para nuestra caja."
        },
        {
          "fase": 3,
          "titulo_fase": "Construyendo nuestra Caja Inteligente",
          "descripcion": "Usando cajas de cartón, colores y pegamento, cada equipo construye su propia estación de reciclaje. Deben decorar cada compartimento de forma que represente las reglas que crearon (ej. dibujos de cáscaras de fruta para lo orgánico)."
        },
        {
          "fase": 4,
          "titulo_fase": "¡Guardianes en Acción! La Gran Demostración",
          "descripcion": "Cada equipo presenta su 'Caja Inteligente' a la clase. Explican sus reglas de clasificación y demuestran cómo funciona tirando diferentes tipos de basura, justificando por qué cada objeto va en su lugar."
        }
      ],
      "metodo_evaluacion_adaptado": "Se evaluará mediante una rúbrica la claridad de las reglas de clasificación, la creatividad en la construcción de la caja y la efectividad de la explicación oral del equipo.",
      "pregunta_al_docente_adaptada": "¿Cómo puede usar objetos del día a día (juguetes, útiles, envolturas) para que los niños practiquen la creación de 'reglas de clasificación' antes de abordar el problema de la basura?"
    },
    {
      "nivel_escolar": "Secundaria",
      "titulo_adaptado": "El Detector de Viralidad: ¿Podemos Predecir el Próximo Trend?",
      "pregunta_esencial_adaptada": "Las redes sociales parecen 'adivinar' qué se hará viral. ¿Podemos descubrir su secreto y crear un sistema simple que prediga si un video o meme de nuestra escuela podría ser popular?",
      "producto_final_adaptado": "Un modelo de clasificación de imágenes entrenado con una herramienta visual y sencilla como 'Teachable Machine' de Google. El entregable es un video corto donde demuestran su modelo funcionando y explican los patrones que creen que 'aprendió'.",
      "objetivos_adaptados": [
        "Recolectar y organizar un pequeño conjunto de imágenes para 'entrenar' a una IA.",
        "Utilizar una herramienta digital de 'arrastrar y soltar' para experimentar con el entrenamiento de un modelo de clasificación.",
        "Analizar los resultados para identificar patrones básicos y reflexionar sobre posibles 'preferencias' o sesgos del sistema."
      ],
      "fases_adaptadas": [
        {
          "fase": 1,
          "titulo_fase": "Anatomía de un 'Like'",
          "descripcion": "En equipos, analizar contenido viral real. Su tarea es listar las características que tienen en común (ej: usan música en tendencia, son cortos, son graciosos). Introducir así los conceptos de 'características' y 'etiquetas' (ej. 'viral' o 'no viral')."
        },
        {
          "fase": 2,
          "titulo_fase": "Misión: Crear Nuestro Álbum de Datos",
          "descripcion": "Los equipos buscan o crean memes y contenido relevante para su escuela. Crean dos carpetas en la computadora: 'Populares' y 'No Populares', y guardan al menos 20 imágenes en cada una. Este será su conjunto de datos para el entrenamiento."
        },
        {
          "fase": 3,
          "titulo_fase": "Entrenando al 'Adivino' Digital",
          "descripcion": "Introducción guiada a 'Teachable Machine'. Los estudiantes suben sus carpetas de imágenes para entrenar al modelo. Experimentan en tiempo real dándole nuevas imágenes y viendo cómo las clasifica, ajustando si es necesario."
        },
        {
          "fase": 4,
          "titulo_fase": "Presentando Nuestro Detector de Viralidad",
          "descripcion": "Grabar un video de 3 minutos. En él, deben: 1) Explicar su pregunta, 2) Mostrar su álbum de datos, 3) Demostrar su modelo clasificando un nuevo meme en vivo, y 4) Discutir qué 'aprendió' el modelo y si tuvo algún sesgo (ej. 'solo le gustan los memes con gatos')."
        }
      ],
      "metodo_evaluacion_adaptado": "Mediante una rúbrica que evalúa la calidad del álbum de datos, la funcionalidad del modelo en el video y la profundidad del análisis sobre los patrones y sesgos encontrados.",
      "pregunta_al_docente_adaptada": "¿Cómo puede guiar una discusión sobre el 'sesgo' si el modelo de los estudiantes muestra resultados inesperados, usando ejemplos de sus propias redes sociales?"
    },
    {
      "nivel_escolar": "Preparatoria",
      "titulo_adaptado": "El Analista de Tendencias: Descifrando Patrones con Hojas de Cálculo",
      "pregunta_esencial_adaptada": "Las grandes empresas usan datos para predecir tendencias. ¿Podemos usar una herramienta que todos conocemos, una hoja de cálculo, para analizar datos de nuestra comunidad y descubrir patrones ocultos que nos ayuden a tomar mejores decisiones?",
      "producto_final_adaptado": "Un 'Reporte de Análisis' creado en Google Sheets o Excel. El reporte debe incluir tablas de datos organizadas, al menos tres visualizaciones (gráficos) que revelen un patrón interesante y una sección de conclusiones con recomendaciones basadas en la evidencia encontrada.",
      "objetivos_adaptados": [
        "Aplicar funciones de hojas de cálculo (ordenar, filtrar, fórmulas simples) para organizar y limpiar un conjunto de datos.",
        "Crear visualizaciones de datos (gráficos de barras, circulares, de líneas) para comunicar hallazgos de manera efectiva.",
        "Formular conclusiones y recomendaciones basadas estrictamente en la evidencia presentada por los datos."
      ],
      "fases_adaptadas": [
        {
          "fase": 1,
          "titulo_fase": "La Pregunta y la Recolección de Datos",
          "descripcion": "En equipos, formular una pregunta sobre su comunidad escolar (ej. '¿Cuál es el género musical más popular en la prepa?'). Diseñar y aplicar una encuesta simple (Google Forms) para recolectar los datos y exportarlos a una hoja de cálculo."
        },
        {
          "fase": 2,
          "titulo_fase": "Limpieza y Exploración de Datos",
          "descripcion": "Introducción a las 'buenas prácticas' en hojas de cálculo. Los alumnos aprenden a limpiar sus datos (corregir errores de escritura, eliminar duplicados) y a usar funciones como ORDENAR y FILTRAR para empezar a explorar la información."
        },
        {
          "fase": 3,
          "titulo_fase": "El Poder de Visualizar: Creando Gráficos",
          "descripcion": "Aprender a crear diferentes tipos de gráficos para responder su pregunta inicial. Experimentan para descubrir qué tipo de gráfico (barras, pastel, etc.) cuenta la historia de sus datos de la manera más clara y convincente."
        },
        {
          "fase": 4,
          "titulo_fase": "El Reporte Final: Conclusiones Basadas en Evidencia",
          "descripcion": "Organizar sus gráficos y tablas en un 'dashboard' o reporte final dentro de la hoja de cálculo. Escribir una sección de conclusiones donde interpreten sus hallazgos y propongan una recomendación a la escuela basada en los datos (ej. 'Recomendamos que en el próximo evento se incluya más música de este género')."
        }
      ],
      "metodo_evaluacion_adaptado": "Evaluación del reporte en la hoja de cálculo, valorando la limpieza de los datos, la claridad y relevancia de los gráficos, y la coherencia lógica entre los datos, las conclusiones y las recomendaciones.",
      "pregunta_al_docente_adaptada": "¿Qué preguntas de investigación sencillas pero interesantes sobre la vida escolar podrían proponer a sus alumnos para que sientan una mayor apropiación del proyecto desde el inicio?"
    },
    {
      "nivel_escolar": "Universidad",
      "titulo_adaptado": "Análisis Predictivo para el Impacto Social: Un Modelo para un Problema Comunitario",
      "pregunta_esencial_adaptada": "¿Cómo podemos diseñar, entrenar y validar un modelo de machine learning que aborde un problema cuantificable en nuestra comunidad (ej. predecir zonas de alto tráfico, optimizar el uso de recursos, o predecir la deserción estudiantil)?",
      "producto_final_adaptado": "Un paper de investigación en formato académico que presente un modelo de machine learning para un problema social. Debe incluir: revisión de literatura, metodología (preprocesamiento de datos, selección de modelo), resultados (métricas rigurosas como Precisión, Recall, F1-Score) y una discusión profunda. Se acompaña de un repositorio en GitHub con el código documentado.",
      "objetivos_adaptados": [
        "Formular una pregunta de investigación y realizar una revisión de literatura sobre aplicaciones de ML en el dominio del problema.",
        "Seleccionar, justificar y aplicar técnicas de preprocesamiento de datos y entrenamiento de modelos usando librerías especializadas (Scikit-learn, TensorFlow/PyTorch).",
        "Evaluar rigurosamente el rendimiento de un modelo y comunicar los hallazgos, implicaciones y limitaciones en un formato técnico profesional."
      ],
      "fases_adaptadas": [
        {
          "fase": 1,
          "titulo_fase": "Definición del Problema e Investigación de Vanguardia",
          "descripcion": "Elegir un problema social medible. Encontrar y analizar artículos de investigación existentes sobre el tema. Formular una hipótesis y redactar una propuesta de proyecto que defina el alcance, los datasets potenciales y los modelos a explorar."
        },
        {
          "fase": 2,
          "titulo_fase": "Ingeniería de Datos: Adquisición, Limpieza y Creación de Características",
          "descripcion": "Obtener y consolidar el dataset. Realizar un preprocesamiento exhaustivo: imputación de datos faltantes, normalización/estandarización. Aplicar ingeniería de características (feature engineering) para crear nuevas variables predictivas."
        },
        {
          "fase": 3,
          "titulo_fase": "Modelado, Entrenamiento y Validación Rigurosa",
          "descripcion": "Implementar y entrenar múltiples modelos. Utilizar validación cruzada (cross-validation) para una evaluación robusta y realizar ajuste de hiperparámetros para optimizar el rendimiento."
        },
        {
          "fase": 4,
          "titulo_fase": "Interpretación, Discusión y Comunicación de Resultados",
          "descripcion": "Analizar los resultados. Utilizar técnicas de interpretabilidad (ej. SHAP) para entender las decisiones del modelo. Redactar el paper de investigación completo y publicar el código documentado en GitHub."
        }
      ],
      "metodo_evaluacion_adaptado": "Evaluación basada en la calidad del paper de investigación (rigor metodológico, profundidad del análisis) y la calidad del repositorio de código (documentación, reproducibilidad). Posible defensa oral del proyecto.",
      "pregunta_al_docente_adaptada": "¿Cómo puede estructurar sesiones de 'revisión de pares' (peer review) donde los estudiantes presenten sus resultados intermedios y reciban retroalimentación crítica, simulando un entorno de conferencia académica?"
    }
  ]
}